app/controllers/posts_controller.rb

INSERT INTO "posts" ("name", "created_at", "updated_at", "date", "message") VALUES('Thomson', '2010-04-05 02:08:37', '2010-04-05 02:08:37', '2010-04-05', 'get my act together. ')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save